In [56]:
import pandas as pd

In [57]:
data = {
    'DateOfBirth': [2002, 2007, 1976, 1976],
    'Name': ["Ravshan", "Gulshan", "Feruza", "Muxiddin"],
    'Temp': [4, 5, 7, 9]
}

df = pd.DataFrame(data)

In [58]:
df

   DateOfBirth      Name  Temp
0         2002   Ravshan     4
1         2007   Gulshan     5
2         1976    Feruza     7
3         1976  Muxiddin     9

In [59]:
df.head()

   DateOfBirth      Name  Temp
0         2002   Ravshan     4
1         2007   Gulshan     5
2         1976    Feruza     7
3         1976  Muxiddin     9

In [60]:
df.head(3)

   DateOfBirth     Name  Temp
0         2002  Ravshan     4
1         2007  Gulshan     5
2         1976   Feruza     7

In [61]:
df.shape

(4, 3)

In [62]:
df.size

12

In [63]:
df = pd.DataFrame(data, columns=['Name', 'Temp', 'DateOfBirth'])

In [64]:
df.head()

       Name  Temp  DateOfBirth
0   Ravshan     4         2002
1   Gulshan     5         2007
2    Feruza     7         1976
3  Muxiddin     9         1976

In [65]:
df = pd.DataFrame(data, columns=['Name', 'Temp', 'DateOfBirth', 'isMarried'])

In [66]:
df.head()

       Name  Temp  DateOfBirth isMarried
0   Ravshan     4         2002       NaN
1   Gulshan     5         2007       NaN
2    Feruza     7         1976       NaN
3  Muxiddin     9         1976       NaN

In [67]:
df = pd.DataFrame(data, columns=['Name', 'Temp', 'DateOfBirth', 'isMarried'], index=[11, 17, 8, 10])

In [68]:
df

        Name  Temp  DateOfBirth isMarried
11   Ravshan     4         2002       NaN
17   Gulshan     5         2007       NaN
8     Feruza     7         1976       NaN
10  Muxiddin     9         1976       NaN

In [69]:
ismlar = df['Name']

In [70]:
type(ismlar)

pandas.core.series.Series

In [71]:
df.DateOfBirth

11    2002
17    2007
8     1976
10    1976
Name: DateOfBirth, dtype: int64

In [72]:
df['isMarried'] = False

In [73]:
df

        Name  Temp  DateOfBirth  isMarried
11   Ravshan     4         2002      False
17   Gulshan     5         2007      False
8     Feruza     7         1976      False
10  Muxiddin     9         1976      False

In [74]:
val = pd.Series([True, True], index=[8, 10])
df.isMarried = val

In [75]:
df

        Name  Temp  DateOfBirth isMarried
11   Ravshan     4         2002       NaN
17   Gulshan     5         2007       NaN
8     Feruza     7         1976      True
10  Muxiddin     9         1976      True

In [76]:
df['5+'] = df.Temp > 5

In [77]:
df

        Name  Temp  DateOfBirth isMarried     5+
11   Ravshan     4         2002       NaN  False
17   Gulshan     5         2007       NaN  False
8     Feruza     7         1976      True   True
10  Muxiddin     9         1976      True   True

In [78]:
del df['3+']

KeyError: '3+'

In [ ]:
df

        Name  Temp  DateOfBirth isMarried     5+
11   Ravshan     4         2002       NaN  False
17   Gulshan     5         2007       NaN  False
8     Feruza     7         1976      True   True
10  Muxiddin     9         1976      True   True

In [ ]:
del df['5+']

In [ ]:
df

        Name  Temp  DateOfBirth isMarried
11   Ravshan     4         2002       NaN
17   Gulshan     5         2007       NaN
8     Feruza     7         1976      True
10  Muxiddin     9         1976      True

In [ ]:
val = pd.Series([False, False, True, True], index=[11, 17, 8, 10])
df['isMarried'] = val

In [ ]:
df

        Name  Temp  DateOfBirth  isMarried
11   Ravshan     4         2002      False
17   Gulshan     5         2007      False
8     Feruza     7         1976       True
10  Muxiddin     9         1976       True

In [79]:
df['Name'].name = 'Ism'

In [81]:
df['Name']

11     Ravshan
17     Gulshan
8       Feruza
10    Muxiddin
Name: Ism, dtype: object